RDVMI.rdvmi-ext/src/InformationRegisters/рдв_РегистрацияИзменений/рдв_РегистрацияИзменений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рдв_РегистрацияИзменений</name>
  <resources>
    <name>ВыгружаемыйОбъект</name>
    <type>
      <types>CatalogRef.рдв_ВыгружаемыеОбъекты</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.рдв_СтатусыРегистрацииИзменений</types>
    </type>
  </resources>
  <resources>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ДатаРегистрацииВМиллисекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RDVMI.rdvmi-ext/src/CommonModules/рдв_РегистрацияИзменений/Module.bsl
// Обработчик подписки на событие рдв_РегистрацияИзменений
//
Процедура рдв_РегистрацияИзмененийПриЗаписи(Источник, Отказ) Экспорт

    ЗарегистрироватьИзменения(Источник);
	
КонецПроцедуры

// Обработчик подписки на событие рдв_РегистрацияИзмененийНабораЗаписей
//
Процедура рдв_РегистрацияИзмененийНабораЗаписейПриЗаписи(Источник, Отказ, Замещение) Экспорт

    ЗарегистрироватьИзменения(Источник);

КонецПроцедуры

// Регистрирует изменения объекта к обмену.
//
// Параметры:
//  Источник - СправочникОбъект, ДокументОбъект, НаборЗаписейОбъект - Объект, регистрируемый к обмену.
//  Отказ - Булево - Отказ записи объекта.
//
Процедура ЗарегистрироватьИзменения(Источник, ИдентификаторСобытия = Неопределено) Экспорт

	ПравилаРегистрации = рдв_РегистрацияИмененийПовтИсп.ИнициализироватьПравилаРегистрации();
	МетаданныеИсточника = Источник.Метаданные();
	СтрокиПравил = ПравилаРегистрации.НайтиСтроки(Новый Структура("МетаданныеОбъекта", МетаданныеИсточника));
	Для Каждого ПравилоРегистрации Из СтрокиПравил Цикл
		ВыгружаемыйОбъект = Справочники.рдв_ВыгружаемыеОбъекты.СоздатьВыгружаемыйОбъект(Источник);
		РегистрыСведений.рдв_РегистрацияИзменений.ЗарегистрироватьИзменениеОбъекта(ВыгружаемыйОбъект, ПравилоРегистрации, ИдентификаторСобытия);
	КонецЦикла;
	
КонецПроцедуры
